OpenFOAM-2112/reservoir_Euler/0.model/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    "(spillway)"
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.0015;
        Cs              uniform 0.5;
        value           uniform 0;
    }
    "(left|right|bottom)"
    {
        type            calculated;
        value           uniform 0;
    }
    lid
    {
        type            calculated;
        value           uniform 0;
    }	
}

// ************************************************************************* //
