OpenFOAM-2112/reservoir_Euler/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-200 0 -11)
    (  20 0 -11)
    (  20 1 -11)
    (-200 1 -11)

    (-200 0 8)
    (  20 0 8)
    (  20 1 8)
    (-200 1 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (550 3 48) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch right
    (
        (0 1 5 4)
    )
    patch left
    (
        (2 3 7 6)
    )
    wall bottom
    (
        (0 3 2 1)
    )
    patch lid
    (
        (4 5 6 7)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (1 2 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
